"""
及格率：(低于及格线个数÷总成绩个数)×100%
平均值：全部成绩的总合÷总成绩个数
方差：所有成绩的平方和 ÷ 总成绩个数 - 平均值的平方
(语文成绩的平方 + 数学成绩的平方 + 英语成绩的平方) / 3 - (((语文成绩 + 数学成绩 + 英语成绩) / 3) ** 2)
1. 添加学生信息   学生姓名 学号 语文成绩 数学成绩 英语成绩
2. 根据学生学号查看学生成绩
3. 统计：各学生的 平均成绩 成绩方差    班级各科及格率  平均成绩
4. 根据学号修改学生信息
5. 根据学号删除学生
6. 保存学生信息
7. 退出系统
"""

score_sheet = [
    # {'姓名': '张开', '学号': 123, '年龄': 18, '数学': 35.0, '语文': 92.0, '英语': 88.0},
    # {'姓名': '李开', '学号': 234, '年龄': 18, '数学': 95.0, '语文': 22.0, '英语': 78.0},
    # {'姓名': '王开', '学号': 345, '年龄': 20, '数学': 66.0, '语文': 22.0, '英语': 8.0}
]
Path = './info.txt'

def read_file():
    with open(Path,mode='r',encoding="utf-8") as f:
        title = f.readline().strip().split(',')
        print(title)
        for line in f:
            print(line.strip())

# # def AddStudent():
# cmd = input("""
# 1: 添加学生信息
# 2: 根据学号查看学生信息
# 3: 根据学号更新学生信息
# 4: 根据学号删除学生信息
# 5: 统计信息
# 6: 保存学生信息
# 7: 退出系统
# >>>
# """.strip())
#
# if cmd.isdigit():
#     if cmd == "1":
#         pass
#     elif cmd == "2":
#         pass
#     elif cmd == "3":
#         pass
#     elif cmd == "4":
#         pass
#     elif cmd == "5":
#         pass
#     elif cmd == "6":
#         pass
#     elif cmd == "7":
#         pass
# else:
#     print("请输入正确的功能序号")

if __name__ == '__main__':
    read_file()


